xml/InformationRegisters/ИИА_ТокенИндекс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИИА_ТокенИндекс</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>TF</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючЧанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>72</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/InformationRegisters/ИИА_Чанки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИИА_Чанки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Хэш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИндекса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КлючЧанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>72</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/InformationRegisters/ИИА_ТокенСтатистика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИИА_ТокенСтатистика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>DF</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDF</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/CommonModules/ИИА_RAG_Поиск/Ext/Module.bsl
// Модуль для выполнения поиска по индексу метаданных

// Выполняет поиск по текстовому запросу
//
// Параметры:
//  ЗапросТекст - Строка - Поисковый запрос пользователя
//  TopK - Число - Количество возвращаемых результатов
//  Контекст - Структура - Дополнительный контекст для бустинга (ActiveObjectName, ActiveSection)
//
// Возвращаемое значение:
//  ТаблицаЗначений - Результаты поиска (Rank, Score, Тип, Имя, Синоним, Путь, КлючЧанка, Причины)
Функция Найти(Знач ЗапросТекст, Знач TopK = 10, Знач Контекст = Неопределено) Экспорт
	
	Результаты = СформироватьТаблицуРезультатов();
	
	Если ПустаяСтрока(ЗапросТекст) Тогда
		Возврат Результаты;
	КонецЕсли;
	
	// 1. Подготовка запроса
	СтопСлова = ИИА_RAG_Настройки.ПолучитьСтопСлова();
	Синонимы  = ИИА_RAG_Настройки.ПолучитьСинонимы();
	
	НормЗапрос = ИИА_RAG_Текст.Нормализовать(ЗапросТекст);
	ТокеныЗапроса = ИИА_RAG_Текст.Токенизировать(НормЗапрос, СтопСлова);
	
	Если ТокеныЗапроса.Количество() = 0 Тогда
		Возврат Результаты;
	КонецЕсли;
	
	// Query Expansion (расширение синонимами)
	ВсеТокены = Новый Массив;
	Для каждого Токен Из ТокеныЗапроса Цикл
		ВсеТокены.Добавить(Токен);
		СписокСинонимов = Синонимы[Токен];
		Если СписокСинонимов <> Неопределено Тогда
			Для каждого Синоним Из СписокСинонимов Цикл
				Если ВсеТокены.Найти(Синоним) = Неопределено Тогда
					ВсеТокены.Добавить(Синоним);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// 2. Поиск кандидатов и расчет базового Score (BM25-lite)
	// Score = sum(IDF * TF)
	Кандидаты = Новый Соответствие; // КлючЧанка -> Число (Score)
	Причины   = Новый Соответствие; // КлючЧанка -> Массив строк
	
	Для каждого Токен Из ВсеТокены Цикл
		
		// Получаем IDF токена
		IDF = ПолучитьIDF(Токен);
		Если IDF = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем все чанки, содержащие токен
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ИИА_ТокенИндекс.КлючЧанка КАК КлючЧанка,
		|	ИИА_ТокенИндекс.TF КАК TF
		|ИЗ
		|	РегистрСведений.ИИА_ТокенИндекс КАК ИИА_ТокенИндекс
		|ГДЕ
		|	ИИА_ТокенИндекс.Токен = &Токен");
		
		Запрос.УстановитьПараметр("Токен", Токен);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Ключ = Выборка.КлючЧанка;
			Score = IDF * Выборка.TF;
			
			Кандидаты.Вставить(Ключ, ?(Кандидаты[Ключ] = Неопределено, Score, Кандидаты[Ключ] + Score));
			
			// Сохраняем причину
			МассивПричин = Причины[Ключ];
			Если МассивПричин = Неопределено Тогда
				МассивПричин = Новый Массив;
				Причины.Вставить(Ключ, МассивПричин);
			КонецЕсли;
			МассивПричин.Добавить("токен:" + Токен);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Кандидаты.Количество() = 0 Тогда
		Возврат Результаты;
	КонецЕсли;
	
	// 3. Дополнительное ранжирование (Бонусы)
	КлючиКандидатов = Новый Массив;
	Для каждого Пара Из Кандидаты Цикл
		КлючиКандидатов.Добавить(Пара.Ключ);
	КонецЦикла;
	
	// Получаем детали чанков пачкой
	ДеталиЧанков = ПолучитьДеталиЧанков(КлючиКандидатов);
	
	Для каждого СтрДетали Из ДеталиЧанков Цикл
		
		Ключ = СтрДетали.КлючЧанка;
		Бонус = 0;
		
		НормИмя = ИИА_RAG_Текст.Нормализовать(СтрДетали.Имя);
		НормСиноним = ИИА_RAG_Текст.Нормализовать(СтрДетали.Синоним);
		
		// Бонус за точное совпадение в имени или синониме
		Если Найти(НормИмя, НормЗапрос) > 0 Тогда
			Бонус = Бонус + 100;
			Причины[Ключ].Добавить("совпадение:имя");
		КонецЕсли;
		
		Если Найти(НормСиноним, НормЗапрос) > 0 Тогда
			Бонус = Бонус + 120;
			Причины[Ключ].Добавить("совпадение:синоним");
		КонецЕсли;
		
		// Контекстный бустинг
		Если Контекст <> Неопределено Тогда
			// Бустинг активного объекта
			Если Контекст.Свойство("ActiveObjectName") И Контекст.ActiveObjectName = СтрДетали.Имя Тогда
				Бонус = Бонус + 80;
				Причины[Ключ].Добавить("контекст:активный объект");
			КонецЕсли;
		КонецЕсли;
		
		Кандидаты.Вставить(Ключ, Кандидаты[Ключ] + Бонус);
		
	КонецЦикла;
	
	// 4. Формирование финальной таблицы и сортировка
	Для каждого Пара Из Кандидаты Цикл
		
		Ключ = Пара.Ключ;
		Score = Пара.Значение;
		
		СтрДетали = ДеталиЧанков.Найти(Ключ, "КлючЧанка");
		
		НоваяСтрока = Результаты.Добавить();
		НоваяСтрока.Score = Score;
		НоваяСтрока.КлючЧанка = Ключ;
		
		Если СтрДетали <> Неопределено Тогда
			НоваяСтрока.Тип = СтрДетали.Тип;
			НоваяСтрока.Имя = СтрДетали.Имя;
			НоваяСтрока.Синоним = СтрДетали.Синоним;
			НоваяСтрока.Путь = СтрДетали.Путь;
		КонецЕсли;
		
		НоваяСтрока.Причины = СтрСоединить(Причины[Ключ], "; ");
		
	КонецЦикла;
	
	Результаты.Сортировать("Score Убыв");
	
	// Оставляем только TopK и проставляем Rank
	Пока Результаты.Количество() > TopK Цикл
		Результаты.Удалить(Результаты.Количество() - 1);
	КонецЦикла;
	
	Для Индекс = 0 По Результаты.Количество() - 1 Цикл
		Результаты[Индекс].Rank = Индекс + 1;
	КонецЦикла;
	
	Возврат Результаты;
	
КонецФункции

// Возвращает структуру с данными чанка для отображения пользователю или передачи в LLM
//
// Параметры:
//  КлючЧанка - Строка - Идентификатор чанка
//
// Возвращаемое значение:
//  Структура - Данные чанка (Заголовок, Текст, Путь, Тип)
Функция ПолучитьКонтекст(Знач КлючЧанка) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИИА_Чанки.Тип КАК Тип,
	|	ИИА_Чанки.Имя КАК Имя,
	|	ИИА_Чанки.Синоним КАК Синоним,
	|	ИИА_Чанки.Путь КАК Путь,
	|	ИИА_Чанки.Текст КАК Текст
	|ИЗ
	|	РегистрСведений.ИИА_Чанки КАК ИИА_Чанки
	|ГДЕ
	|	ИИА_Чанки.КлючЧанка = &КлючЧанка");
	
	Запрос.УстановитьПараметр("КлючЧанка", КлючЧанка);
	Выполнение = Запрос.Выполнить();
	
	Если Выполнение.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Выполнение.Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Результат.Вставить("Тип", Выборка.Тип);
	Результат.Вставить("Имя", Выборка.Имя);
	Результат.Вставить("Синоним", Выборка.Синоним);
	Результат.Вставить("Путь", Выборка.Путь);
	
	Текст = "";
	Если ТипЗнч(Выборка.Текст) = Тип("ХранилищеЗначения") Тогда
		Текст = Выборка.Текст.Получить();
	КонецЕсли;
	Результат.Вставить("Текст", Текст);
	
	Результат.Вставить("Заголовок", СтрШаблон("%1: %2 (%3)", Выборка.Тип, Выборка.Синоним, Выборка.Имя));
	
	Возврат Результат;
	
КонецФункции

// Вспомогательные функции

Функция СформироватьТаблицуРезультатов()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Rank", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("Score", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Синоним", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Путь", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("КлючЧанка", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Причины", Новый ОписаниеТипов("Строка"));
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьIDF(Токен)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИИА_ТокенСтатистика.IDF КАК IDF
	|ИЗ
	|	РегистрСведений.ИИА_ТокенСтатистика КАК ИИА_ТокенСтатистика
	|ГДЕ
	|	ИИА_ТокенСтатистика.Токен = &Токен");
	
	Запрос.УстановитьПараметр("Токен", Токен);
	Выполнение = Запрос.Выполнить();
	
	Если Выполнение.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = Выполнение.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.IDF;
	
КонецФункции

Функция ПолучитьДеталиЧанков(Ключи)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИИА_Чанки.КлючЧанка КАК КлючЧанка,
	|	ИИА_Чанки.Тип КАК Тип,
	|	ИИА_Чанки.Имя КАК Имя,
	|	ИИА_Чанки.Синоним КАК Синоним,
	|	ИИА_Чанки.Путь КАК Путь
	|ИЗ
	|	РегистрСведений.ИИА_Чанки КАК ИИА_Чанки
	|ГДЕ
	|	ИИА_Чанки.КлючЧанка В(&Ключи)");
	
	Запрос.УстановитьПараметр("Ключи", Ключи);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
